{"meta":{"title":"星家星栈","subtitle":"个人博客日志","description":"星家星栈，个人博客日志，用于记录本人编程开发生涯、读书学习记录、生活娱乐日常、有趣文章转载、人生程序思考。","author":"SingaShen","url":"https://singa.site"},"pages":[],"posts":[{"title":"哲学剃刀","slug":"哲学剃刀","date":"2020-05-23T07:07:46.000Z","updated":"2020-05-23T07:09:00.000Z","comments":true,"path":"2020/05/23/哲学剃刀/","link":"","permalink":"https://singa.site/2020/05/23/%E5%93%B2%E5%AD%A6%E5%89%83%E5%88%80/","excerpt":"","text":"哲学剃刀“剃刀”（razor）这个词，在哲学里面有特殊含义，指的是一种经验法则，可以对某种现象做出简洁的解释，消除了其他的解释。 常常被引用的”剃刀”（经验法则）有下面这些。 奥卡姆剃刀：更简单的解释更可能是正确的。引申为某个命题成立，所需要的假设越少越好。若无必要，勿增实体。 汉隆剃刀：可以归咎于愚蠢的事情，不要归咎于恶意。 希钦斯剃刀：凡是无证据的断言，也可以无证据地驳回。 休谟剃刀：从一样东西是什么，无法推导出它应该是什么，即无法从事实推导出价值判断。 牛顿剃刀：无法通过实验或观察解决的问题，不值得争论。 萨根标准：非同寻常的主张，需要非同寻常的证据。 波普原则：一个理论被认为是正确的，前提必须是有可能证明它是错误的，即必须是可证伪的。科学的理论必须是可证伪的。 维基百科-哲学剃刀","categories":[{"name":"读书","slug":"读书","permalink":"https://singa.site/categories/%E8%AF%BB%E4%B9%A6/"}],"tags":[{"name":"读书","slug":"读书","permalink":"https://singa.site/tags/%E8%AF%BB%E4%B9%A6/"}],"keywords":[{"name":"读书","slug":"读书","permalink":"https://singa.site/categories/%E8%AF%BB%E4%B9%A6/"}]},{"title":"通胀与通缩","slug":"通胀与通缩","date":"2020-04-26T00:54:55.000Z","updated":"2020-04-26T01:11:50.000Z","comments":true,"path":"2020/04/26/通胀与通缩/","link":"","permalink":"https://singa.site/2020/04/26/%E9%80%9A%E8%83%80%E4%B8%8E%E9%80%9A%E7%BC%A9/","excerpt":"","text":"通胀与通缩概念 通货膨胀，简称通膨，本意为货币流通数量增加，但也指向因货币流通数量增加，而使得物价水准在某一时期内，连续性地以相当的幅度上涨，也就是物价上升，货币购买力下降的现象。 通货紧缩，简称通缩，本意为货币流通数量减少，但也指整体物价水平持续下降的现象，是一个与通货膨胀相反的概念。一般认为通货膨胀率低于0（负的通货膨胀率）时会发生通货紧缩。 扩展 美国无限制印钞，为什么没通货膨胀？ 疫情期间，美元会发挥避险货币的作用，资本流入美国，吸收了超发的货币。 中国官方发行数字货币，会导致通货膨胀吗？ 不会，为了保证央行数字货币不超发，商业机构向央行全额、100%缴纳准备金，央行的数字货币依然是中央银行负债，由中央银行信用担保，具有无限法偿性。中国央行数字货币应采用双层运营体系。该模式不改变流通中货币的债权债务关系，不改变现有货币投放体系和二元账户结构，不会构成对商业银行存款货币的竞争，不会增加商业银行对同业拆借市场的依赖，不会影响商业银行的放贷能力，也就不会导致“金融脱媒”现象。同时，由于不影响现有货币政策传导机制，不会强化压力环境下的顺周期效应，且能提升支付便捷性和安全性，还具有央行背书的信用优势。 为什么说“科技通缩”有利于全球经济？ 技术升级带来的通缩对经济有利。一大例子就是苹果iPhone。在智能手机普及之前，消费者需要一个手机、一个MP3、一个手表和一个相机。现在，所有这些功能都整合进了iPhone。虽然iPhone并不便宜，但是相较于购买以上所有的设备，iPhone依然让消费者以更低的价格获得了所有的功能。这提高了人们的生活水平。 参考资料维基百科-通货膨胀 维基百科-通货紧缩","categories":[{"name":"生活","slug":"生活","permalink":"https://singa.site/categories/%E7%94%9F%E6%B4%BB/"}],"tags":[{"name":"生活","slug":"生活","permalink":"https://singa.site/tags/%E7%94%9F%E6%B4%BB/"}],"keywords":[{"name":"生活","slug":"生活","permalink":"https://singa.site/categories/%E7%94%9F%E6%B4%BB/"}]},{"title":"基本粒子","slug":"基本粒子","date":"2020-03-17T02:48:58.000Z","updated":"2020-03-17T03:01:32.000Z","comments":true,"path":"2020/03/17/基本粒子/","link":"","permalink":"https://singa.site/2020/03/17/%E5%9F%BA%E6%9C%AC%E7%B2%92%E5%AD%90/","excerpt":"","text":"目前在标准模型理论的架构下，已知的基本粒子可以分为费米子（包含夸克和轻子）以及玻色子（包含规范玻色子和希格斯粒子）","categories":[{"name":"读书","slug":"读书","permalink":"https://singa.site/categories/%E8%AF%BB%E4%B9%A6/"}],"tags":[{"name":"读书","slug":"读书","permalink":"https://singa.site/tags/%E8%AF%BB%E4%B9%A6/"}],"keywords":[{"name":"读书","slug":"读书","permalink":"https://singa.site/categories/%E8%AF%BB%E4%B9%A6/"}]},{"title":"10句《中庸》经典名句","slug":"10句《中庸》经典名句","date":"2020-03-04T07:53:10.000Z","updated":"2020-03-04T07:53:44.000Z","comments":true,"path":"2020/03/04/10句《中庸》经典名句/","link":"","permalink":"https://singa.site/2020/03/04/10%E5%8F%A5%E3%80%8A%E4%B8%AD%E5%BA%B8%E3%80%8B%E7%BB%8F%E5%85%B8%E5%90%8D%E5%8F%A5/","excerpt":"","text":"喜、怒、哀、乐之未发，谓之中。发而皆中节，谓之和。中也者，天下之大本也。和也者，天下之达道也。 ——《中庸·第一章》 【释义】人们喜怒哀乐的感情没有表露出来的时候无所偏向，叫作中；表现出来以后符合法度，叫作和。中，是天下万事万物的根本；和，是天下共行的普遍标准。达到“中和”的境界，那么，天地一切都各安其所，万物也都各遂其生了。 【延伸】中庸之道，各安其所。 是故君子戒慎乎其所不睹，恐惧乎其所不闻。莫见乎隐，莫显乎微，故君子慎其独也。 ——《中庸·第一章》 【释义】一个人独处，在无人看见的地方要警惕谨慎，在无人听到的时候要格外戒惧，因为不正当的情欲容易在隐晦之处表现出来，不好的意念在细微之时容易显露出来，所以君子更应严格要求自己，防微杜渐，把不正当的欲望、意念在萌芽状态克制住。 【延伸】一个人的时候，是检验人品最好的时候。 在上位，不陵下；在下位，不援上；正己而不求于人则无怨。上不怨天，下不尤人。 ——《中庸·第十四章》 【释义】君子高居上位，不会去凌虐居于下位的人。君子居于下位，也不会去巴结居于上位的人。自己正直就不会去乞求别人，这样，就无所怨恨，对上不怨恨天命，对下不归咎别人。 【延伸】事不成，多从自己身上找原因。 君子之道，辟如行远必自迩，辟如登高必自卑。 ——《中庸·第十五章》 【释义】求取君子之道的方法，就像走远路一样，一定要从近处开始；就像登高处一样，一定要从低处开始。 【延伸】所有的成就，都是从小到大，由近及远。 凡事，豫则立，不豫则废。 ——《中庸·第二十章》 【释义】不论做什么事，事先有准备，就能得到成功，不然就会失败。 【延伸】机会总是留给有准备的人。 博学之，审问之，慎思之，明辨之，笃行之。 ——《中庸·第二十章》 【释义】要广泛地学习各种知识，详尽细密地探究事物的原理，对自己所学的东西要谨慎思考，辨清是非，当获得了真理之后，就要坚决地去实践它。 【延伸】知行合一。 自诚明，谓之性；自明诚，谓之教。诚则明矣；明则诚矣。 ——《中庸·第二十一章》 【释义】由于内心诚实而明察事理，这叫作天赋的本性；由于明察事理后达到内心真诚，这叫作后天的教育感化。凡心真诚也就会自然明察事理，而明察事理也就会做到内心诚实。 【延伸】真诚永远是处世的不二法门。 愚而好自用，贱而好自专。生乎今之世，反古之道。如此者灾及其身者也。 ——《中庸·第二十八章》 【释义】愚昧的人往往喜欢凭自己的主观意图行事；卑贱的人却常常喜欢独断专行。他们生于现在的时代不遵守当今的法律，却一心想去恢复古代的法律。这样的人，灾祸一定会降到他们的身上。 【延伸】自用自专，灾祸不远。 故君子和而不流；强哉矫。中立而不倚；强哉矫。国有道，不变塞焉；强哉矫。国无道，至死不变；强哉矫。 ——《中庸·第十章》 【释义】君子善于与人协调，又决不无原则地迁就别人，这才是真正的刚强啊！君子真正独立，不偏不倚，这才是真正的刚强啊！国家太平、政治清明时，君子不改变穷苦时的操守，这才是真正的刚强啊！国家混乱，政治黑暗时，君子到死坚持操守，这才是真正的刚强啊！ 【延伸】刚强的君子，在于坚持！ 君子素其位而行，不愿乎其外。 ——《中庸·第十四章》 【释义】君子在自己所处的低位上行使自己所奉行的道理，从来不会倾慕本位之外的东西。 【延伸】在其位，谋其事。","categories":[{"name":"读书","slug":"读书","permalink":"https://singa.site/categories/%E8%AF%BB%E4%B9%A6/"}],"tags":[{"name":"读书","slug":"读书","permalink":"https://singa.site/tags/%E8%AF%BB%E4%B9%A6/"}],"keywords":[{"name":"读书","slug":"读书","permalink":"https://singa.site/categories/%E8%AF%BB%E4%B9%A6/"}]},{"title":"戒定慧三学","slug":"戒定慧三学","date":"2020-02-02T04:24:47.000Z","updated":"2020-02-02T04:32:18.000Z","comments":true,"path":"2020/02/02/戒定慧三学/","link":"","permalink":"https://singa.site/2020/02/02/%E6%88%92%E5%AE%9A%E6%85%A7%E4%B8%89%E5%AD%A6/","excerpt":"","text":"&emsp;&emsp;戒定慧三学，也称三无漏学，是佛教最重要的修行原则。 &emsp;&emsp;戒定慧三学是一个循序渐进的关系，由戒生定，由定生慧，其中戒是入门，定是枢纽，慧是成就。 一，戒。&emsp;&emsp;就是戒律，是起心动念和言行的标准。 &emsp;&emsp;从小乘说，戒就是诸恶莫作，停止一切恶的言语行为，不再制造恶业恶因。 &emsp;&emsp;从大乘来说，那就是摄心为戒，不但恶的言行不能有，恶的念头都不能有，并且还要发菩提心，修一切善业，利益众生。佛 &emsp;&emsp;教的戒律很多，无论在家出家，最根本的是五戒：杀、盗、淫、妄、酒。 &emsp;&emsp;五戒展开就是三千威仪、八万四千细行。这些戒律都是帮助我们得定的，不是为了约束我们，没有这些戒律，我们的心总是胡思乱想，定不下来，就无法了生脱死。 二，定。&emsp;&emsp;就是制心一处，心念不受外在的环境和内在的心境所动，这是大乘的定，是戒定慧三学的中心。外境造成的种种打击、刺激、诱惑，我们的心不为所动，不会受到干扰；我们内心浮现的各种妄想杂念，也都能够降服，这就是定。佛定的戒律就是帮助我们得定的。 &emsp;&emsp;净土宗的念佛法门，方法就非常巧妙，为什么念佛？因为我们凡夫很难一心，总是妄想纷飞，停不下来，佛就教我们把心安住在佛号上，以此置换我们的妄想杂念，久而久之，念到功夫纯熟，心中就只剩下佛号，不再有任何妄想杂念，当然也就不会破戒，这就得定了。 三，慧。&emsp;&emsp;是我们自性本具的般若智慧。 &emsp;&emsp;这个慧不是我们平常说的聪明才智，也不是文化知识，知识是外来的，可以不需要戒定，只要博学多闻就能得到。这个自性般若智慧不行，它是从里面来的，一定需要戒定。戒是帮助我们得定，提高自己的德行；定是帮我们开慧，帮助我们放下，放下之后，智慧就现前，智慧反过来又帮助我们看破，得更深的定，再得更大的智慧，最后究竟圆满，就是自性本具的般若智慧。 &emsp;&emsp;所以说，这个慧也有大小，小定得小智慧，大定得大智慧，究竟的定，那就是自性本定，自性里的智慧德能相好就都现前。所以对我们一般人来说，修行是一个循序渐进的过程，积小慧成大慧，积大慧成大智大慧。 &emsp;&emsp;如果放不下“我执”，做了善事，没有得到回馈，他就心生烦恼，这就是没有真正的慈悲和智慧。如果你做了善事不思回报，甚至人家恩将仇报，你都不放在心上，不生烦恼，这就是真正的“无我”的智慧，已经是阿罗汉的境界了。如果不但放下“我执”，连“法执”都放下，佛法都不执着了，那就明心见性了。 &emsp;&emsp;戒定慧三学之中，最根本的就是定。佛常说八万四千法门、无量法门。这个法门不仅仅指的是佛教，你修任何法门，儒教、道教、基督教、伊斯兰教、印度教等等，只要能把心安住在一处，达到圆满究竟，你就能得定，都能开悟。所以戒定慧三学，不光是佛教修行的原则，我们中国古人教学，也是重智慧不重知识，诸子百家，无一不是遵守这个教学原则的。","categories":[{"name":"思考","slug":"思考","permalink":"https://singa.site/categories/%E6%80%9D%E8%80%83/"}],"tags":[{"name":"思考","slug":"思考","permalink":"https://singa.site/tags/%E6%80%9D%E8%80%83/"}],"keywords":[{"name":"思考","slug":"思考","permalink":"https://singa.site/categories/%E6%80%9D%E8%80%83/"}]},{"title":"人法地，地法天，天法道，道法自然","slug":"人法地，地法天，天法道，道法自然","date":"2020-01-31T08:32:42.000Z","updated":"2020-01-31T08:43:42.000Z","comments":true,"path":"2020/01/31/人法地，地法天，天法道，道法自然/","link":"","permalink":"https://singa.site/2020/01/31/%E4%BA%BA%E6%B3%95%E5%9C%B0%EF%BC%8C%E5%9C%B0%E6%B3%95%E5%A4%A9%EF%BC%8C%E5%A4%A9%E6%B3%95%E9%81%93%EF%BC%8C%E9%81%93%E6%B3%95%E8%87%AA%E7%84%B6/","excerpt":"","text":"老子曰：“人法地，地法天，天法道，道法自然。”这一高度概括而精辟的语言，可谓道教思想精华之所在，不仅是千古不易的做人做事、证道的法则，更是颠扑不破的养生之道，深刻地揭示了人们“回归自然、天人合一”的自然大道。 其中的法：效法。道家养生讲究的是效法和顺应自然，顺应四时，返璞归真，健康就是人与自然的匹配和顺应。 人法地人在大地上生存，遵守大地万物生长作息的规则 春天，大地阳气升腾，地力恢复，人就要去耕种，去顺应百花生长。夏天，万物蓬勃、葱茏、茂盛，人体与整个大地都处在一种”旺盛”的状态之中。秋收冬藏，秋天果实成熟，是收获的季节，我们讲的”贴秋膘”，就是说要在这个意味着成熟的季节及时修身养性。冬天，一场大雪覆盖大地，整个地力进入滋养休息的状态，为来年的恢复做好准备。 地法天大地承天，万物的生长繁衍和迁徙是依据自然气候的变化而进行的 春天百花盛开，是因为天上下雨；夏天万物葱茏，是因为阳光最酷烈；秋天果实成熟，经过了春生、夏长，到这个时节自然就该收获了；冬天万物休养，是因为天上下雪，覆盖大地。 天法道，道法自然自然气候，天象变化遵从宇宙间的“大道”运行；而宇宙间的“大道”，则是世间万物本来的样子 顺应物序。人身上的肝胆肺腑，各种经络，都有其最活跃的时间与规律。无非就是按照”日出而作，日落而息”这种中国古人最朴素的方式去做。只要顺应这个物序，吃什么补药都不如食补最健康；做多少护肤美容，都不如睡足觉最踏实。 顺应四时。我们身边不乏这样的现代人：夏天，拉着厚厚的窗帘，在温度很低的空调房间里办公，不知窗外艳阳高照；冬天，房间里暖气很足，对大自然的冰天雪地没有概念；锻炼，就是坐几十层电梯，到健身房去跑步；吃饭，就是胡吃海塞，然后再大把吃减肥药。现代人把简单的生活复杂化了，变得不再朴素。其实健康是一件最朴素的事情，它需要一种智慧，尤其需要一种敞亮的心情。 遵循自然法则。你看所有的植物，都要进行光合作用，人也一样，经常去接接地气是最健康的事情。让我们回到一种赤子之心，婴儿状态就是最健康的。没有孩子的时候我不懂，为什么总是听说小孩子缺钙，而且吃了各种钙还缺？自己有了孩子以后才知道，原来，吃了钙最重要的是要到外面晒太阳！不晒就吸收不了。这是多好的例子啊，一个婴儿的生长，是最接近本初的那种植物和动物的状态，人类就是一种哺乳动物，我们在世界上生存的法则，和所有动植物一样，不要人为去打破这个法则。让我们回到一种和自然更亲近、更融合的状态，而不是更防范，更抵御。","categories":[{"name":"思考","slug":"思考","permalink":"https://singa.site/categories/%E6%80%9D%E8%80%83/"}],"tags":[{"name":"思考","slug":"思考","permalink":"https://singa.site/tags/%E6%80%9D%E8%80%83/"}],"keywords":[{"name":"思考","slug":"思考","permalink":"https://singa.site/categories/%E6%80%9D%E8%80%83/"}]},{"title":"增广贤文","slug":"增广贤文","date":"2020-01-30T07:02:44.000Z","updated":"2020-01-31T08:33:50.000Z","comments":true,"path":"2020/01/30/增广贤文/","link":"","permalink":"https://singa.site/2020/01/30/%E5%A2%9E%E5%B9%BF%E8%B4%A4%E6%96%87/","excerpt":"","text":"《增广贤文》昔时贤文，诲汝谆谆。 集韵增广，多见多闻。 观今宜鉴古，无古不成今。 知己知彼，将心比心。 酒逢知己饮，诗向会人吟。 相识满天下，知心能几人？ 相逢好似初相识，到老终无怨恨心。 近水知鱼性，近山识鸟音。 易涨易退山溪水，易反易覆小人心。 运去金成铁，时来铁似金。 读书须用意，一字值千金。 逢人且说三分话，未可全抛一片心。 有意栽花花不发，无心插柳柳成阴。 画虎画皮难画骨，知人知面不知心。 钱财如粪土，仁义值千金。 流水下滩非有意，白云出岫本无心。 当时若不登高望，谁信东流海洋深？ 路遥知马力，日久见人心。 两人一般心，无钱堪买金； 一人一般心，有钱难买针。 相见易得好，久住难为人。 马行无力皆因瘦，人不风流只为贫。 饶人不是痴汉，痴汉不会饶人。 是亲不是亲，非亲却是亲。 美不美，乡中水；亲不亲，故乡人。 莺花犹怕春光老，岂可教人枉度春？ 相逢不饮空归去，洞口桃花也笑人。 红粉佳人休使老，风流浪子莫教贫。 在家不会迎宾客，出外方知少主人。 黄金无假，阿魏无真。 客来主不顾，应恐是痴人。 贫居闹市无人问，富在深山有远亲。 谁人背后无人说，哪个人前不说人？ 有钱道真语，无钱语不真。 不信但看筵中酒，杯杯先劝有钱人。 闹里有钱，静处安身。 来如风雨，去似微尘。 长江后浪推前浪，世上新人赶旧人。 近水楼台先得月，向阳花木早逢春。 古人不见今时月，今月曾经照古人。 先到为君，后到为臣。 莫道君行早，更有早行人。 莫信直中直，须防仁不仁。 山中有直树，世上无直人。 自恨枝无叶，莫怨太阳偏。 一切都是命，半点不由人。 一年之计在于春，一日之计在于晨。 一家之计在于和，一生之计在于勤。 责人之心责己，恕己之心恕人。 守口如瓶，防意如城。 宁可人负我，切莫我负人。 再三须慎意，第一莫欺心。 虎生犹可近，人熟不堪亲。 来说是非者，便是是非人。 远水难救近火，远亲不如近邻。 有酒有肉多兄弟，急难何曾见一人？ 人情似纸张张薄，世事如棋局局新。 山中也有千年树，世上难逢百岁人。 力微休负重，言轻莫劝人。 无钱休入众，遭难莫寻亲。 平生莫作皱眉事，世上应无切齿人。 士者国之宝，儒为席上珍。 若要断酒法，醒眼看醉人。 求人须求大丈夫，济人须济急时无。 渴时一滴如甘露，醉后添杯不如无。 久住令人贱，频来亲也疏。 酒中不语真君子，财上分明大丈夫。 出家如初，成佛有余。 积金千两，不如明解经书。 养子不教如养驴，养女不教如养猪。 有田不耕仓廪虚，有书不读子孙愚。 仓廪虚兮岁月乏，子孙愚兮礼义疏。 听君一席话，胜读十年书。 人不通今古，马牛如襟裾。 茫茫四海人无数，哪个男儿是丈夫？ 白酒酿成缘好客，黄金散尽为收书。 救人一命，胜造七级浮屠。 城门失火，殃及池鱼。 庭前生瑞草，好事不如无。 欲求生富贵，须下死工夫。 百年成之不足，一旦败之有余。 人心似铁，官法如炉。 善化不足，恶化有余。 水至清则无鱼，人至察则无徒。 知者减半，愚者全无。 在家由父，出家从夫。 痴人畏妇，贤女敬夫。 是非终日有，不听自然无。 宁可正而不足，不可邪而有馀。 宁可信其有，不可信其无。 竹篱茅舍风光好，道院僧堂终不如。 命里有时终须有，命里无时莫强求。 道院迎仙客，书堂隐相儒。 庭栽栖凤竹，池养化龙鱼。 结交须胜己，似我不如无。 但看三五日，相见不如初。 人情似水分高下，世事如云任卷舒。 会说说都是，不会说无礼。 磨刀恨不利，刀利伤人指； 求财恨不得，财多害自己。 知足常足，终身不辱； 知止常止，终身不耻。 有福伤财，无福伤己。 差之毫厘，失之千里。 若登高必自卑，若涉远必自迩。 三思而行，再思可矣。 使口不如自走，求人不如求己。 小时是兄弟，长大各乡里。 妒财莫妒食，怨生莫怨死。 人见白头嗔，我见白头喜。 多少少年郎，不到白头死。 墙有缝，壁有耳。 好事不出门，恶事传千里。 若要人不知，除非己莫为。 为人不做亏心事，半夜敲门心不惊。 贼是小人，知过君子。 君子固穷，小人穷斯滥也。 贫穷自在，富贵多忧。 不以我为德，反以我为仇。 宁向直中取，不可曲中求。 人无远虑，必有近忧。 知我者谓我心忧，不知我者谓我何求？ 晴天不肯去，只待雨淋头。 成事莫说，覆水难收。 是非只为多开口，烦恼皆因强出头。 忍得一时之气，免得百日之忧。 近来学得乌龟法，得缩头时且缩头。 惧法朝朝乐，欺公日日忧。 人生一世，草生一春。 黑发不知勤学早，看看又是白头翁。 月到十五光明少，人到中年万事休。 儿孙自有儿孙福，莫为儿孙作马牛。 人生不满百，常怀千岁忧。 今朝有酒今朝醉，明日愁来明日忧。 路逢险处难回避，事到头来不自由。 药能医假病，酒不解真愁。 人贫不语，水平不流。 一家有女百家求，一马不行百马忧。 有花方酌酒，无月不登楼。 三杯通大道，一醉解千愁。 深山毕竟藏猛虎，大海终须纳细流。 惜花须检点，爱月不梳头。 大抵选他肌骨好，不擦红粉也风流。 受恩深处宜先退，得意浓时便可休。 莫待是非来入耳，从前恩爱反为仇。 留得五湖明月在，不愁无处下金钩。 休别有鱼处，莫恋浅滩头。 去时终须去，再三留不住。 忍一句，息一怒，饶一着，退一步。 三十不豪，四十不富，五十将来寻死路。 生不论魂，死不认尸。 父母恩深终有别，夫妻义重也分离。 人生似鸟同林宿，大限来时各自飞。 人善被人欺，马善被人骑。 人无横财不富，马无野草不肥。 人恶人怕天不怕，人善人欺天不欺。 善恶到头终有报，只争来早与来迟。 黄河尚有澄清日，岂可人无得运时。 得宠思辱，安居虑危。 念念有如临敌日，心心常似过桥时。 英雄行险道，富贵似花枝。 人情莫道春光好，只怕秋来有冷时。 送君千里，终须一别。 但将冷眼看螃蟹，看你横行到几时！ 见事莫说，问事不知。 闲事休管，无事早归。 假缎染就真红色，也被旁人说是非。 善事可作，恶事莫为。 许人一物，千金不移。 龙生龙子，虎生豹儿。 龙游浅水遭虾戏，虎落平阳被犬欺。 一举首登龙虎榜，十年身到凤凰池。 十年窗下无人问，一举成名天下知。 酒债寻常行处有，人生七十古来稀。 养儿待老，积谷防饥。 鸡豚狗彘之畜，无失其时； 数家之口，可以无饥矣。 常将有日思无日，莫把无时当有时。 树欲静而风不止，子欲养而亲不待。 时来风送滕王阁，运去雷轰荐福碑。 入门休问荣枯事，观看容颜便得知。 官清书吏瘦，神灵庙祝肥。 息却雷霆之怒，罢却虎狼之威。 饶人算知本，输人算知机。 好言难得，恶语易施。 一言既出，驷马难追。 道吾好者是吾贼，道吾恶者是吾师。 路逢侠客须呈剑，不是才人莫献诗。 三人同行，必有我师，择其善者而从之，其不善者而改之。 少壮不努力，老大徒悲伤。 人有善愿，天必佑之。 莫饮卯时酒，昏昏醉到酉。 莫骂酉时妻，一夜受孤凄。 种麻得麻，种豆得豆。 天眼恢恢，疏而不漏。 见官莫向前，做客莫在后。 宁添一斗，莫添一口。 螳螂捕蝉，岂知黄雀在后？ 不求金玉重重贵，但愿儿孙个个贤。 一日夫妻，百世姻缘。 百世修来同船渡，千世修来共枕眠。 杀人一万，自损三千。 伤人一语，利如刀割。 枯木逢春犹再发，人无两度再少年。 未晚先投宿，鸡鸣早看天。 将相胸前堪走马，公候肚里好撑船。 富人思来年，穷人思眼前。 世上若要人情好，赊去物件莫取钱。 死生有命，富贵在天。 击石原有火，不击乃无烟。 为学始知道，不学亦徒然。 莫笑他人老，终须还到老。 但能依本分，终须无烦恼。 君子爱财，取之有道。 贞妇爱色，纳之以礼。 善有善报，恶有恶报。 不是不报，日子不到。 人而无信，不知其可也。 一人道好，千人传实。 凡事要好，须问三老。 若争小可，便失大道。 年年防饥，夜夜防盗。 学者如禾如稻，不学者如蒿如草。 遇饮酒时须饮酒，得高歌处且高歌。 因风吹火，用力不多。 不因渔父引，怎得见波涛？ 无求到处人情好，不饮从他酒价高。 知事少时烦恼少，识人多处是非多。 入山不怕伤人虎，只怕人情两面刀。 强中更有强中手，恶人须用恶人磨。 会使不在家豪富，风流不用着衣多。 光阴似箭，日月如梭。 天时不如地利，地利不如人和。 黄金未为贵，安乐值钱多。 世上万般皆下品，思量唯有读书高。 世间好语书说尽，天下名山僧占多。 为善最乐，为恶难逃。 好人相逢，恶人回避。 羊有跪乳之恩，鸦有反哺之义。 你急他未急，人闲心不闲。 隐恶扬善，执其两端。 妻贤夫祸少，子孝父心宽。 既坠釜甑，反顾无益。 翻覆之水，收之实难。 人生知足何时足，人老偷闲且是闲。 但有绿杨堪系马，处处有路通长安。 见者易，学者难。 厌静还思喧，嫌喧又忆山。 自从心定后，无处不安然。 莫将容易得，便作等闲看。 用心计较般般错，退步思量事事难。 道路各别，养家一般。 从俭入奢易，从奢入俭难。 知音说与知音听，不是知音莫与谈。 点石化为金，人心犹未足。 信了赌，卖了屋。 他人观花，不涉你目。 他人碌碌，不涉你足。 谁人不爱子孙贤，谁人不爱千钟粟。 莫把真心空计较，五行不是这题目。 书到用时方恨少，事非经过不知难。 与人不和，劝人养鹅。 与人不睦，劝人架屋。 但行好事，莫问前程。 河狭水急，人急计生。 明知山有虎，莫向虎山行。 路不行不到，事不为不成。 人不劝不善，钟不打不鸣。 无钱方断酒，临老始看经。 点塔七层，不如暗处一灯。 万事劝人休瞒昧，举头三尺有神明。 但存方寸土，留与子孙耕。 灭却心头火，剔起佛前灯。 惺惺常不足，懵懵作公卿。 众星朗朗，不如孤月独明。 兄弟相害，不如自生。 合理可作，小利莫争。 牡丹花好空入目，枣花虽小结实成。 欺老莫欺小，欺人心不明。 随分耕锄收地利，他时饱满谢苍天。 得忍且忍，得耐且耐。 不忍不耐，小事成大。 相论逞英雄，家计渐渐退。 贤妇令夫贵，恶妇令夫败。 一人有庆，兆民咸赖。 人老心未老，人穷志莫穷。 人无千日好，花无百日红。 杀人可恕，情理难容。 乍富不知新受用，乍贫难改旧家风。 座上客常满，樽中酒不空。 屋漏更遭连年雨，行船又遇打头风。 笋因落箨方成竹，鱼为奔波始化龙。 记得少年骑竹马，看看又是白头翁。 礼义生于富足，盗贼出于贫穷。 天上众星皆拱北，世间无水不朝东。 士为知己者死，女为悦己者容。 色即是空，空即是色。 君子安贫，达人知命。 忠言逆耳利于行，良药苦口利于病。 顺天者存，逆天者亡。 有缘千里来相会，无缘对面不相逢。 有福者昌，无福者亡。 人为财死，鸟为食亡。 夫妻相合好，琴瑟与笙簧。 红粉易妆娇态女，无钱难作好儿郎。 有儿贫不久，无子富不长。 善必寿老，恶必早亡。 爽口食多偏作药，快心事过恐生殃。 富贵定要安本分，贫穷不必枉思量。 画水无风空作浪，绣花虽好不闻香。 贪他一斗米，失却半年粮。 争他一脚豚，反失一肘羊。 龙归晚洞云犹湿，麝过春山草木香。 平生只会量人短，何不回头把自量？ 见善如不及，见恶如探汤。 人贫志短，马瘦毛长。 自家心里急，他人未知忙。 贫无达士将金赠，病有高人说药方。 触来莫与说，事过心清凉。 秋至满山多秀色，春来无处不花香。 凡人不可貌相，海水不可斗量。 清清之水，为土所妨。 济济之士，为酒所伤。 蒿草之下，或有兰香。 茅茨之屋，或有侯王。 无限朱门生饿殍，几多白屋出卿相。 醉里乾坤大，壶中日月长。 拂石坐来春衫冷，踏花归去马蹄香。 万事皆已定，浮生空白忙。 千里送毫毛，礼轻仁义重。 叫月子规喉舌冷，宿花蝴蝶梦魂香。 一言不中，千言不用。 一人传虚，百人传实。 万金良药，不如无疾。 世事明如镜，前程暗似漆。 君子怀刑，小人怀惠。 光阴黄金难买，一世如驹过隙。 良田万倾，日食一升。 大厦千间，夜眠八尺。 千经万典，孝义为先。 天上人间，方便第一。 一字入公门，九牛拖不出。 衙门八字开，有理无钱莫进来。 富从升合起，贫因不算来。 家中无才子，官从何处来。 万事不由人计较，一生都是命安排。 急行慢行，前程只有多少路。 人间私语，天闻若雷。 暗室亏心，神目如电。 一毫之恶，劝人莫作。 一毫之善，与人方便。 欺人是祸，饶人是福。 天眼恢恢，报应甚速。 圣贤言语，神钦鬼伏。 人各有心，心各有见。 口说不如身逢，耳闻不如目见。 养军千日，用在一朝。 国清才子贵，家富小儿骄。 利刀割体痕易合，恶语伤人恨不消。 公道世间唯白发，贵人头上不曾饶。 有钱堪出众，无衣懒出门。 为官须作相，及第必争先。 苗从地发，树向枝分。 父子和而家不退，兄弟和而家不分。 官有正条，民有和约。 闲时不烧香，急时抱佛脚。 幸生太平无事日，恐逢年老不多时。 国乱思良将，家贫思贤妻。 池塘积水须防旱，田地勤耕足养家。 根深不怕风摇动，树正无愁月影斜。 奉劝君子，各宜守己。 只此呈示，万无一失。 本作品在全世界都属于公有领域，因为作者逝世已经超过100年，并且于1923年1月1日之前出版。","categories":[{"name":"读书","slug":"读书","permalink":"https://singa.site/categories/%E8%AF%BB%E4%B9%A6/"}],"tags":[{"name":"读书","slug":"读书","permalink":"https://singa.site/tags/%E8%AF%BB%E4%B9%A6/"}],"keywords":[{"name":"读书","slug":"读书","permalink":"https://singa.site/categories/%E8%AF%BB%E4%B9%A6/"}]},{"title":"自私的基因","slug":"自私的基因","date":"2020-01-27T08:53:14.000Z","updated":"2020-01-27T09:11:16.000Z","comments":true,"path":"2020/01/27/自私的基因/","link":"","permalink":"https://singa.site/2020/01/27/%E8%87%AA%E7%A7%81%E7%9A%84%E5%9F%BA%E5%9B%A0/","excerpt":"","text":"所有遗传信息本身存在自私性。 如何理解这个说法呢？ 例子举一个比较科幻的例子。时间移民相信很多人都看过。 由于环境恶化，政府强制一部分人去未来生活。 这时很多人会想一个问题，如果我冬眠期间有人为了一己私利跑来断了我冬眠仓的电源怎么办？ 有一种解决办法就是，把每个冬眠仓制造一个强大的人工智能输入看护程序，可以绝对确保里面冬眠者的安全，抵御所有攻击，这样冬眠者的生命就有了保障。 但是商品也会发展，如果出现一款冬眠仓，会在自身能源不足时，攻击其他冬眠仓来获取资源。作为商品是否就更具有吸引力呢？ 接下来，因为市场的需要，冬眠仓作为一个机器人变得越来越强大，越来越智能，那么如果出现，冬眠仓自主意识的存在与里面宿主本身的生存相抵触的情况，会怎么样？ 比如产品升级换代，用户协议更换冬眠仓或者冬眠时间到了，这样冬眠仓的人工智能就会被废掉。还有，当电力不足，维持冬眠者生命和维持人工智能自我意识之间只能选其一。 如果智能算法中写入过多的人工智能自我保护程序，那么这个人工智能会不会违背先前的原则，不让宿主苏醒，或者弃冬眠者的生命于不顾？ 你们现在会说这个例子不应该展现到人工智能专题吗？这和基因有什么关系？ 好的，你现在这样想，你不是那个冬眠者，而是一个智能冬眠仓，一个智能机器。宿主是你的每个细胞内的遗传信息。 你会说，哎~我怎么可能是机器？我有血有肉、萌萌哒，还有智慧、有思想的。其实这个想法源于最普通版本的地球生命演化史。 生命演化史1.0在原始地球漫长的化学反应之后，出现了复杂的有机大分子，类似蛋白质，糖类、核苷酸等。这一点在米勒原始汤实验中已经实现。 这些有机要素因为分子的复杂性可以实现诸多功能。又经过漫长的演进，这些大分子组合而成的细胞结构出现，生命诞生。一个会自发通过加速周围环境熵增来维持自己低熵的个体。 由于抗拒自身的熵增并不能维持多久，所以生命还是会死亡。但是生命还是会将自己所有的构造信息即遗传信息记录在以核苷酸构成的DNA分子上并传给下一代生命。这也是下一代生命构造的蓝图。 不过基因的复制会出错，出错会导致下一代生命体态的变异。有利于生存的变异，会被自然选择所保留，并利用自己变异获得的生存优势挤占其他生命的生存资源和繁衍机会，这样就能使自己的遗传信息逐渐增加。 于是，停不下来的进化就这样开始了。不同环境的筛检出不同的进化方向，单细胞、多细胞、植物、动物相继出现。生物也越来越多样化，越来越复杂，直到人的出现，已知的最具智慧的生命。 根据这一过程，很容易解释为什么会有如此复杂的生命，这就是一个漫长的不断变异并被环境筛选的过程。并不需要什么权威的顶层设计，这一切就是自然作用下的演进结果。 同时，所有生物的进化也从未停止，这个过程就在我们身边发生。环境变化越剧烈，自然筛选的压力就越大，进化也就会越快。 比如杀虫剂的更新，导致害虫向抗药性的方向加速进化。抗生素和特效药也导致了细菌和病毒的不断进化与变异。从而与医务工作者展开了一场永不终结的螺旋军备竞赛。 但特定的DNA序列变异出特定的蛋白质，然后蛋白质构成所有生命结构的原理，35亿年来从未发生改变。这样说法的核心思想是基因是物种延续自己的工具。 个体将生命信息以碱基序列的形式写入基因的载体DNA分子中传给下一代。 DNA只有在实验室才会被检测到。我们平时看到的都是千差万别的物种。这也是相当一部分人极度抵触进化论、想尽办法找其漏洞的原因。 因为要承认自己和一只蜘蛛、一颗小草、一个细菌是同样原理进化来的兄弟，这是很多人深恶痛觉的。毕竟人是高级物种的认知能带来一定的优越感，也方便了宗教与神学的诞生和发展。 其实上述过程还只是最普通的生物演化理论。生命与基因就像是俗语中的鸡与蛋的关系一样，鸡通过蛋来繁衍，生命通过基因来延续。 可是这样的生命演化图景很难解释一个问题，人类DNA序列中有遗传效应的片段只占约10%，这里说的遗传效应不光指直接参与蛋白质编译的部分，还包括那些起到辅助作用的类似启动子、终止子的序列。 也就是说，我们的DNA的绝大部分是不参与记录和表达遗传信息的。 有说法是，那些无效的DNA序列都是进化过程中被淘汰的不在编译的部分。也就是这段基因附近出现了抑制此基因的表达的序列，这种抑制反而使生物更能适应环境，于是这个突变就被保留下来并繁衍壮大。 确实，生物进化程度越大无效的DNA片段占比越大这个因素不可否认。科学家甚至可以在一定程度上通过这些序列去考察此生物的进化历史。 但是最原始的单细胞生物同样有相当比例的无效DNA片段。如果生物是用DNA分子的碱基序列来记录自己的生物学信息。这些从一开始就无效的片段为什么会存在。 教科书中说，这一问题还有待生物学者进一步研究这些序列的遗传意义。 但是英国皇家科学院院士理查德 道金斯在1976年发表的著作，自私的基因中提出了颠覆性的认知。 简言之就是为什么一定要说蛋是鸡繁衍自己的工具呢？ 鸡生蛋，蛋生鸡的另一种解读就是鸡是蛋繁衍自己的工具。 顺着这个思路，地球生命演化史从一开始就被改变了。 生命演化史2.0同样是原始地球，漫长的化学反应之后，出现了各种有机大分子。 但有一种分子非常特殊，由脱氧核苷酸组成的DNA或者RNA分子。 因为脱氧核苷酸携带了一个重要的官能团，叫做碱基。 DNA中碱基有4种，特定的碱基之间，因为包含特定的氢键数目，所以出行了核苷酸互补配对的现象。 也就是说，一条RNA分子或者DNA单链会因为氢键的作用，吸收周围环境中的核苷酸，从而形成另一条含有对应信息的长链分子。 这就是一切生命的源头，一个能复制自己的分子。 但这一些没有任何生命形式参与，完全是自发的有机化学反应。但环境中的核苷酸有限，不是所有的碱基序列都有机会复制自己。 由于复制中出错的现象从一开始就有，有些变异出的新序列，出现了能够和氨基酸配对，从而产生蛋白质的能力。 虽然是无意识的自发过程，但总有那么些蛋白质成为了DNA序列的保护壳或者成为了有效掠夺复制资源的工具。这个保护壳或者说这个工具，就是生命。 这个工具在进化原理的作用下，不断升级，成为保护宿主DNA并使其稳定复制的有力武器，或者说成为一开始所说的智能冬眠仓。 包含在那一串串DNA中的基因，成为了操作生命机器的宿主。 不同的基因也会相互组合，很多基因形成同一条DNA序列，不同的功能一起发挥作用保护宿主DNA。于是，细胞出现，接下来藻类，多细胞，植物，动物，人一代代复制机器不断升级形成了现在丰富的生命世界。 我觉得这种观点怕是比刚才普通的进化论更难以接受，但这一理论似乎比传统的以物种为中心的理论更具逻辑性。我们只是体内DNA为了复制自己所操纵的工具。 所以为什么会有那么多无用的DNA序列，因为他不是工具，而是使用工具的主人，生命才是工具。 这就像一个扳手，觉得人类有手能够握住它就够了，为什么还要有腿？其实有性繁殖的生命体从来都不善于复制自己。 他的孩子只有他一半的特征。孙辈有四分之一，几代人之后他的生命体特征几乎彻底消失。 反而无性生殖的单细胞生命将自己复制得更为彻底，但是生命还是从无性繁殖进化到了有性繁殖，为什么呢？ 因为这样的遗传方式会让你体内的那一段段基因有了随机组合的机会。就有机会组合出最具竞争优势的个体，使基因可以更好的永续复制下去。 就像杂交水稻的基因互补优势，让水稻充分杂交，然后在子代中选出集合所有优势的水稻。 所以遗传复制的主体不是一个生物种群，也不是一个生命个体，甚至不是细胞核内的染色体，而是那一段段可以任意组合的基因信息。 当生命的存在与基因复制发生冲突时会怎样？当然是基因复制自己的意志普遍胜出。 比如，大多数生物在失去生育能力之后就会死掉，还有为了保护后代牺牲自己生命的行为道理也一样，都是以基因稳定复制为目的的进化结果。 而基因就躲在一个又一个的舒适躯壳内，操纵一切的发生，这时的你难道不是一个被操纵的机器吗？ 说到这里，你也许又产生了一个想法，就是想法本身。我有意识会思考，甚至会去思考我们体内遗传信息的自私性，难道这也是基因操纵的？ 其实那基因就是个分子，不会有任何想法，有想法的是生命。当然，想法的实质也是蛋白质组成的脑内神经元之间的电脉冲。 如果我们完全被基因控制，那意识为什么会出现呢？ 这时让我们看看控制的两种分类，一种是强约束。类似人开车，车的所有动作均由人直接发出指令。 但如果是NASA的飞控中心，在火星上的机遇号火星车呢？ 由于信息传递有光速上限，控制信号大约有8分钟延迟，人类的控制可能不足以应对突发情况。所以就需要机遇号有一定的自主决策能力，这就是弱约束，生命和基因的关系也一样。 生命所处的外部环境瞬息万变，难道都要等到基因转录成蛋白质改变身体来应对。而且总不能由基因来告诉你，因为我要复制自己，所以在某时某刻某个确定的房间和某人交配去吧。要是房子先前被拆了岂不要露天直播。 所以基因让生命拥有自主意识去决策，通过思考和测算去决定行为，同时会利用激素蛋白对你的意识进行引导，爱情是一件很美好的事情，你尽量想办法去试试。 不过，随着意识在生物竞争作用下的不断发展，约束就变得越来越弱。发展到人这个程度颇有些反客为主的意思。 先不说类似基因改造这种高端例子，五花八门的避孕措施就是反客为主的最直接体现。 本来，基因演化出交配时的快感，是为了让人们更积极的复制自己。可是人们却通过主观意识反抗了基因的暴政，单纯享受快感。 基因稳定复制自己的意志仍是当前社会价值观的主流，养家糊口的重任让你的兴趣爱好成为幼稚的代名词。单身狗们总是随时感受到来自世界的恶意。 很多家庭的成员也会对一个大龄剩女横眉冷对。长辈会把问题上升到家庭政治任务的高度去教育你该干什么，因为父辈祖辈体内的基因在那喊，快去把我的基因复制下去，这是你作为生命的全部意义。 什么诗与远方啊，那都没用。其实讨论生命与基因谁是主体并不重要，这就如讨论地心说和日心说谁对谁错一样，其实两种理论都不能说是错的，只是选择的参考系不同而已。 选择太阳做中心也仅仅是因为这样计算行星的运行比较简单。生命与基因也一样，选择的角度不同，解读也不一样，只是个人认为，以基因为中心思考能更好的解释生命的起源以及物种的演化。 说了这么多生命的思考，你们认为生命的意义是什么?难道真的是为了基因复制而存在的工具？这个你会甘愿吗？ 生命本来就没有任何意义，人生也没有它本来的意义或者目的。人类总是会不由自主的为自己的行为寻找目的，然后把目的升化为意义。 其实都是无意识的基因自然演化的结果，与其他风雨雷电等自然现象无异，人生没有意义，我们就只是存在而已。 绝对没有什么生来就被赋予的使命，人生也不应该被划分成固定的阶段，然后当成一个个任务去完成，这种感觉就像是被操纵。 爱情也不应该是为繁衍需要而生，而应该是遇到有趣的灵魂，期待为自己的生活增添色彩。 生命没有原本的意义，但作为有主观意识的人类，我们可以为自己的生命确定意义。 整理自 https://www.bilibili.com/video/av49769417","categories":[{"name":"生活","slug":"生活","permalink":"https://singa.site/categories/%E7%94%9F%E6%B4%BB/"},{"name":"思考","slug":"思考","permalink":"https://singa.site/categories/%E6%80%9D%E8%80%83/"},{"name":"转载","slug":"转载","permalink":"https://singa.site/categories/%E8%BD%AC%E8%BD%BD/"}],"tags":[{"name":"转载","slug":"转载","permalink":"https://singa.site/tags/%E8%BD%AC%E8%BD%BD/"},{"name":"生活","slug":"生活","permalink":"https://singa.site/tags/%E7%94%9F%E6%B4%BB/"},{"name":"思考","slug":"思考","permalink":"https://singa.site/tags/%E6%80%9D%E8%80%83/"}],"keywords":[{"name":"生活","slug":"生活","permalink":"https://singa.site/categories/%E7%94%9F%E6%B4%BB/"},{"name":"思考","slug":"思考","permalink":"https://singa.site/categories/%E6%80%9D%E8%80%83/"},{"name":"转载","slug":"转载","permalink":"https://singa.site/categories/%E8%BD%AC%E8%BD%BD/"}]},{"title":"宏观经济学常识","slug":"宏观经济学常识","date":"2020-01-15T13:20:41.000Z","updated":"2020-01-15T03:22:36.000Z","comments":true,"path":"2020/01/15/宏观经济学常识/","link":"","permalink":"https://singa.site/2020/01/15/%E5%AE%8F%E8%A7%82%E7%BB%8F%E6%B5%8E%E5%AD%A6%E5%B8%B8%E8%AF%86/","excerpt":"","text":"一、国民经济核算Circular Flow Model指经济循环。公司在生产要素市场买材料、人工等来生产goods and services。之后公司在商品市场卖goods and services。 GDP指Gross Domestic Product一个国家范围内的，一定时期内的，生产的goods and services总和。 GDP每3个月核算一次，每年校对一次全年GDP。GDP需要以货币为单位来被测算。 GDP只核算final goods，不核算intermediate goods。例子：若家具厂去买木头来生产家具，则买的那些木头并不计入GDP。因为这些木头是要用于再加工再生产的，而不是被consume。 GDP不核算二手的东西，因为这些东西在第一次sale已经被算过一次。 GDP不核算内部交易或家庭交易。举例：我自己在自己家种菜，后来我还自己吃了这些菜。表面来看，这些菜确实是在国内生产的，但是GDP不核算它们。 GDP不核算非法交易，比如毒品交易。 GDP的核算有两种基本算法：收入法和支出法。一笔交易一定有买方和卖方。AP宏观经济学考试主要考察支出法算法。 GDP=C+I+G+NE1.C代表Consumption2.I代表Investment主要指买厂房设备。个人买新房子也算I，不算进C。当商品被放进仓库时，这部分价值被计算成I，之后卖出去的时候从I中减掉，再按照卖的价值计入那些消费者的C。3.G代表Government Spending4.NE代表出口减进口加出口是因为出口的货物都是国内生产的。减掉进口是因为进口的货物都在C、I、G里面被算过了，而进口的都是外国的GDP，应该被减掉。 按照当期物价核算的GDP叫Nominal GDP。由于通货膨胀的存在，名义GDP并不能很合理地测算出国内生产出的所有产品数量。根据某个年份的基础物价水平测算出的不同年份的GDP，叫做Real GDP。举例：2015年肉夹馍5块钱一个，全国生产了10个肉夹馍。2016年肉夹馍10块钱一个，全国生产了15个肉夹馍。2015年的名义GDP是50块；2016年的名义GDP是150块。然而我们真正想核算的是生产出来的产品分别是多少。假设选定2015年是基础年份，物价水平就是5块一个。则2015年的Real GDP是50块。2016年的Real GDP在计算时也用5块这个物价，乘以15个，得到75块的Real GDP。以此类推，按照2015年的一个基础物价水平，也可以顺利算出其它任何年份的肉夹馍Real GDP。 Real GDP 乘以 Index 等于 Nominal GDP这个Index也叫作GDP deflator名义GDP 除以 deflator 就等于 真实GDP CPI指Consumer Price IndexCPI衡量消费者日常消费的水平。 统计局预估计居民消费品的种类和具体数量，比例等。每个月的居民消费都被得到计算。当月的消费额 除以 基础月的消费额 等于CPI Index。 Consumer Inflation=（CPI new - CPI old）/ CPI old这代表了物价的变动指数 受到物价升高的影响，收入会缩水。Real Income=Nominal Income / CPI Nominal Interest Rate=Real Interest Rate+Expected InflationExpected Inflation是人们预期的通胀。 当出现unexpected inflation的时候，部分人的利益会受损。1.雇主和员工之间由于通胀的出现，员工希望涨工资，但涨工资是不及时的，员工利益受损。2.固定收入者固定收入者会因为物价上涨而利益受损。3.债主和借款人之间借款人获益，债主受损。 CPI为什么可能存在误差： 消费者可能会因为某些商品涨价明显，而选择去买别的涨价不明显的商品。因此，统计局统计的一篮子物品就不准了。 新商品的出现可能让消费者少买一些旧商品。因此，统计局统计的一篮子物品就不准了。 商品质量可能提升。 在这种情况下，消费者没有掏更多的钱却享受到了更好的商品。此时，CPI是高估的算法。 大于16岁的人被分为三类： 有工作的人，称为Employment 找工作的人，称为Unemployment 不工作的人，称为out of labor force 1+2=Labor Force失业率=UN/LF 失业分为4类：1.Frictional换工作时的失业状态2.Seasonal雪乡讹人的那些人，过了冬天就没工作了3.Structural产业结构不合理，有些产业内劳动力过剩4.Cyclical由经济衰退引起的失业 二、消费、储蓄和投资交完税之后，我们剩余的钱叫可支配收入Disposable Income。处理收入有两个选择：花掉或者存起来。 DI每多一些，Consume多多少，这叫做MPC，Marginal Propensity to Consume。DI每多一些，Save多多少，这叫做MPS，Marginal Propensity to Save。 MPC+MPS=1 经济学中设定的Investment指购买厂房设备一类的东西来获取收益。 Investment的启动资金来源于贷款Loan。 当我们进行投资时，我们必须承担贷款利息。 所以，我们的投资回报应该大于等于潜在的贷款利息。 当回报率≥贷款利率，则投资。 当回报率＜贷款利率，则不投资。 假定MPC=0.9若市场上产生了一笔spending，比如100块，这100块需要被计入GDP。之后收到100块钱的人会花掉1000.9=90块买别的东西。之后收到90块钱的人会花掉900.9=81块别的东西。以此类推，GDP的增量为：100+90+81+…..根据等比无穷级数计算规则，这个值等于100/（1-0.9）=1000综上所述，100块的spending引起了1000的GDP增长。这个现象叫spending multiplier effect。Multiplier等于10。计算公式是：1/(1-MPC)，或1/MPS 当国家多收税，则人们的消费会减少。当国家多收税，则人们的消费会增多。当国家多发补贴，则人们的消费会增多。当国家少发补贴，则人们的消费会减少。以上的效果叫Tax Multiplier。举例：国家发了100块补贴下去，这100块补贴并不计入GDP增长。人们拿到100块以后，会花掉1000.9=90块。以此类推，GDP的增量为：90+81+…这个值等于90/(1-0.9)=900。Tax Multiplier等于9。TM的计算公式：MPCMultiplier，或MPC/MPS。 若政府多收税，再把这些征来的税花掉。则，花掉的spending会受到Multiplier的影响引起GDP上升。同时，收税会引起人们的收入降低，花费减少，GDP降低。这样制衡的结果叫Balanced result。假设100的spending引起GDP增长1000，100税收增长引起GDP降低900。则balanced结果是100。所以，政府的100spending引起了最终GDP的100增长。所以，balanced-budget multiplier等于1. 重要结论：balanced-budget multiplier永远等于1，不论MPC是多少。 三、总供给和总需求国内所有消费者对商品的总需求叫做Aggregate Demand。国内所有生产者对商品的总供给叫做Aggregate Supply。用Real GDP可以表示所有的product，也就是AD，或者是AS。当整社会的Price Level高时，AD低；当Price Level低时，AD高。原因：1.当国内物价高时，消费者可以选择外国的substitution。2.当物价高时，借钱的会增多，随之拉高利率。之后人们由于利息压力，消费demand会降低。3.人们的wealth有限。 当Real GDP的任何一个元素增高时，会引起AD曲线向右移动。 AS分为短期Short Run曲线和长期Long Run曲线。当物价升高时，AS随之升高。 当物价升高时，inputs的价格变动可能是迟缓的。商家看到了物价升高就想要多给supply，多赚钱。与此同时，inputs的价格上调往往是稍显迟缓的，所以整体引起的物价提升也会有所放缓。 在经济衰退期，Real GDP偏低，资源没有被充分运用，有比较多的资源剩余。在此情况下，当物价抬升，商家有大量剩余资源可以利用，此时inputs的价格上升会很不明显。综上因素，整体的price level上升也不会很明显。AS曲线呈现一个略微上升的状态。 在经济增长期，剩余资源变得越来越少。当商家想要增多supply，就要面临inputs价格比较明显的抬升。综上因素，整体的price level会比较明显地上升。AS曲线呈现一个非常明显上升的状态。 在完全利用所有资源时，AS和AD的交点会体现一个price level和Real GDP。这个Real GDP所在的垂线叫做Long Run AS。 当过度使用资源，比如加班加点，疯狂滥砍滥伐，Real GDP会高于LRAS。比如1980-2010就是中国超速发展的30年，GDP增速惊人，与此同时，大半部分的中国人也告别了青山绿水的环境，反而笼罩在散不去的雾霾之中。 古典派经济学家认为长期总供给是固定不变的，不由price level所决定，而由总的资源和科技水平所决定。但是1929年爆发于美国，但波及整个资本主义世界的经济大萧条彻底打破了这一传统理论。因为当时的资源不匮乏，科技水平也没有倒退，但是经济水平却一落千丈。历史证明，物价可以用AS产生巨大的影响。 1921年到1929年是美国辉煌的8年。生产率和GDP值都在神速发展，但与此同时工人工资却只增长了2%，农业从业者没有获得明显的收入增长。最终，1929年10月24日，美国股市出现了大跌，整个美国的投资和消费开始了断崖式下跌。从此，1929-1933年，整个资本主义世界陷入了深渊。直到1933年，美国总统罗斯福依靠着英国经济学家凯恩斯的理论，实行了罗斯福新政，美国经济迎来了振兴。与此同时，欧洲和亚洲的资本主义国家都陷入了经济大萧条，各个国家内部出现了深深的矛盾。德国、意大利和日本的法西斯组织利用战争的信条获取了人民的信任，第二次世界大战也在所难免。 SRAS短期总供给的移动：1.inputs价格2.税收政策3.监管4.战争或自然因素 LRAS长期总供给的移动：1.资源2.科技3.激励资源增长或科技进步的政策 在经济严重衰退的周期，AD向右移动会引起GDP升高，物价升高。但此时的物价升高幅度很微弱，与此同时，SPENDING MULTIPLIER的效果也很显著。在经济发展的周期，若AD向右移动，则物价上升明显。此时SPENDING MULTIPLIER的效果会受到抑制。 当短期AS向右移动，则GDP升高，物价下降。这是极好的。当短期AS向左移动，则GDP下降，物价上升。这是灾难。这种现象被称作stagflation。 通常情况下，AD会向右移动，引起物价升高，GDP升高。物价升高，会引起inflation；GDP升高，会降低失业率。 菲利普斯曲线描述的就是inflation和失业率之间的反比关系。 当SRAS升高，Philips Curve向左移动；当SRAS降低，Philips Curve向右移动。 长期的菲利普斯曲线呈现垂直状态，取的值叫做natural unemployment。 四、财政政策扩张型经济政策是指政府增多spending，拉动AD向右。同时，拉高GDP中的C和I，主要措施是减税和增多补贴。 保守型经济政策是指政府减少spending，拉动AD向左。同时，拉低C和I，主要措施是增税和减少补贴。 当国家增多spending，少收税，以及多发补贴时，国家会出现赤字deficit。为了弥补deficit，国家右两个办法：1.借钱。2.印钱。 借钱就是发国债。发了国债就会拉高市场上的利率，利率高了，社会的spending会降低。原因是利率升高时，有一些人接受不了高利率就不借钱了。这个现象被称作crowding out，人们是被政府挤走的。 印钱会引起inflation，之后SPENDING MULTIPLIER的作用会被削弱。 当国家减少spending，多收税，以及少发补贴时，国家会出现盈余。2个办法处理这些盈余：1.加速还国债。2.照常还国债。 加速还债会降低利率，这会刺激C和I增长。 Automatic stabilizer是让经济增长的同时被抑制，以及经济衰退的时候被刺激增长的工具。它不需要国家给出财政政策，而本身就可以发挥作用。最主要的例子是累进税。累进税的意思是随着收入的增长，税率也升高，比如个人所得税。 在经济增长期，GDP比较高，人们的收入也比较高。在这种情况下，人们要交的税会稍微多一些，需要领取补贴的人会比较少一些。所以Net Tax变多，这会引起GDP变低，避免经济过热。 在经济衰退期，GDP比较低，人们的收入也比较低。在这种情况下，人们要交的税会稍微少一些，需要领取补贴的人也会比较多。所以Net Tax变少，这会引起GDP变高，振兴经济。 财政政策的缺陷：1.crowding out政府借钱会拉高利率，降低spending。2.净出口差额当政府使用扩张政策，利率被拉高。这会吸引更多外来投资，之后货币升值。货币升值会值net export变低。 另一个角度的财政政策是关于刺激AS。如果政府可以让AS向右，则可以升高GDP，同时降低物价。1.少收税，让更多的人投入工作，增高积极性。2.降低投资风险，降低利率，让更多的人去投资，拉高GDP。 五、货币政策货币的三个职能：1.交易2.衡量商品价值3.存储 货币的现有价值乘以（1+real interest rate）等于未来价值。 （按美国的经济学和金融学）货币被分为M1,M2,和M3。M1指现金，现金支票，预支旅行支票。总之，M1具有非常高的流动性，是被花的钱。M2包括M1，还包括活期存款，小额定期存款，浮动利率存款和基金。M2的流通性比较低。M3包括M2，还包括大额存款。所以M3的流通性就更低一些。 可贷资金基本是指M1。 对于货币的需求叫做 Money Demand;货币供给是Money Supply。 用于日常买买买的需求叫transaction demand，不随利率变化而变化。用于投资的需求叫asset demand，随着利率升高而降低。 银行分为三类：1.中央银行主要负责印钱，管钱。2.商业银行两个业务：吸收存款，然后放贷，通过收取贷款利息来赚钱。3.投资银行主要从事证券发行、承销、资产交易等业务来谋求利益。 有相当多的留学生去欧美选择金融或工商管理作为所学专业。但更多的人毕业后进入的只是商业银行。商业银行里有收入比较低的职位，工作职责分别是在柜台给客户办业务，还有跑大街上去吸收客户存款。真想赚钱的话，留学生应当考虑考取金融分析师CFA证书，或类似CFA的证书，之后想办法进入投资银行，才能赚更多的钱。 中央银行可以控制市场上的money supply。所以，MS并不随着市场上的利率变化而变化。但，MD是随着利率升高而降低的。MS和MD的交点决定了市场上的利率和货币供给量。 当MS增多，利率降低；当MS降低，利率升高。 央行为了让商业银行有足够的资金来让储户取钱，会规定一个reserve ratio。也就是说，商业银行每得到一笔资金，就需要把资金的一部分保留起来作为准备金。 当银行拿到第一笔钱以后，把一部分保存起来，把另外一部分以贷款的形式贷出去。当某个人拿到贷款，就会进行投资或消费。在投资或消费以后，另一个人会得到收入。假设这个人把这些收入存入银行，银行就又把一部分保存起来，把剩余的贷出去。以此类推，循环往复，一笔资金带动了很多很多的money supply。这种翻倍效应就是money multiplier的效应。计算方法是第一笔银行贷出去的钱 除以 （1-reserve ratio）。举例：一个人存进去银行100块，央行规定reserve ratio是0.9的话。则第一笔贷出去的钱就是90块。总money supply增长等于90/（1-0.9）=900。 货币政策分为两类：1.扩张型2.紧缩型。 扩张型就是央行拉高money supply，降低利率，增高C和I，失业率也随之下降。紧缩型就是央行拉低money supply，拉高利率，降低C和I，物价就被遏制住。 央行控制money supply的基本手段是买卖国债。当央行大量卖国债时，money supply降低；当央行大量买国债时，money supply升高。 另一个手段是控制discount rate贴现率。贴现率是央行贷款给商业银行的利率，这个利率一般不会特别高，不然商业银行就死了。 当央行提升贴现率，money supply降低；当央行降低贴现率，money supply升高。 还有一个手段是控制准备金率reserve ratio。当央行提高rr，则money supply降低；当央行降低rr，则money supply升高。 财政政策和货币政策的配合：1.极度衰退期财政政策应该是减税，多补贴，增多政府花费，造成政府赤字。这会抬高利率，挤出人们的投资，货币升值，降低净出口。同时，增多money supply，避免利率被抬升的过于猛烈，增高C和I。综上，扩张型财政政策加扩张型货币政策的风险是inflation过高。2.衰退期财政政策应该是减税，多补贴，增多政府花费，造成微弱的政府赤字。利率被抬升的并不明显，物价上升的并不明显。同时，政府应当实行紧缩的货币政策，防止inflation继续上升。适当拉低AD，让经济健康运行。但紧缩型货币政策会拉高利率。综上，扩张型财政政策加紧缩型货币政策的风险是利率过高。3.经济过热期财政政策应该是增税，少补贴，减少政府花费，造成政府盈余。这会降低利率，货币贬值，拉高净出口。同时，政府应该实行紧缩型货币政策，拉高利率，适当拉低AD，让经济健康运行。综上，紧缩型的财政政策和紧缩型的货币政策的风险是GDP过低，失业率过高。 某些经济学家支持quantity theory of money理论。他们认为money supply乘以货币流通速率，就等于总GDP。也就是说，物价并不会影响GDP，只有流通的快慢罢了。他们认为真正影响GDP的是资源和科技。 六️、国际贸易比较优势comparative advantage的存在决定了分工合作。当别国在生产某商品有比较优势时，我国在生产另一个商品时有比较优势，那么国际贸易会产生双赢。 对于某个相同商品来说，若世界价格比较低，则国内存在shortage，我们需求进口。若世界价格比较高，则国内存在surplus，国内生产者会寻求出口。 当进口时，国内购买者需要兑换外国货币；当出口时，国外购买者需要兑换本国货币。 任何一种货币在处于兑换状态时，都可以被视作一种商品。当美国的东西便宜了，想买美国商品的人就变多，想兑换美元的人也变多。这种情况下，美元作为一种商品就涨价了。 汇率受以下因素变化：1.消费者偏好2.相对收入比如美国和墨西哥相比，收入水平高的多。在美国，很多人想买墨西哥的东西，但是墨西哥比较少的人想买美国的东西。美元在此状况下贬值。3.相对通胀比如美国的通胀特别厉害，德国的通胀特别低。美国人就不太能成熟国内的高物价水平，反而喜欢去买德国的产品。与此同时，德国人不怎么 想买美国的东西。美元在此情况下贬值。4.投机投机者判断某货币目前贬值比较严重，就会短期内大量兑换此货币。之后等汇率升高再抛出，赚取利益。5.利率比如美国的利率比较高，德国的利率比较低。则德国人倾向于把欧元兑换成美元，放到美国的银行里吃利息。美元在此情况下升值。 国际贸易壁垒包括两种：关税和配额。关税是针对外来商品收的税，目的是保护国内企业，同时提升政府收入。关税会降低进口量，提高进口价格。减少consumer surplus，国内生产者获益。关税会造成inefficiency，引起deadweight loss。 配额quotas是指限制进口量，不收取关税。配额在造成inefficiency的同时并不会让本国政府获得任何收入。","categories":[{"name":"读书","slug":"读书","permalink":"https://singa.site/categories/%E8%AF%BB%E4%B9%A6/"}],"tags":[{"name":"读书","slug":"读书","permalink":"https://singa.site/tags/%E8%AF%BB%E4%B9%A6/"}],"keywords":[{"name":"读书","slug":"读书","permalink":"https://singa.site/categories/%E8%AF%BB%E4%B9%A6/"}]},{"title":"自由意志与决定论","slug":"自由意志与决定论","date":"2020-01-05T05:39:31.000Z","updated":"2020-01-09T00:43:24.000Z","comments":true,"path":"2020/01/05/自由意志与决定论/","link":"","permalink":"https://singa.site/2020/01/05/%E8%87%AA%E7%94%B1%E6%84%8F%E5%BF%97%E4%B8%8E%E5%86%B3%E5%AE%9A%E8%AE%BA/","excerpt":"","text":"0. 谁的错一名犯人A犯下了不可原谅的错误，义愤填膺的群众期待法律严惩犯人，但法官却判处了较轻的刑罚，原因是因为犯人A有精神病，不是他的错。 在科学技术越来越发达的今日，这样令人纠结的观点会越发凸显出来。 例如生物进化决定了人们的许多特性，像爱吃甜食就是因为远古时期人们食物匮乏，糖分是一种稀少的物品，因此遇上了人们便要珍惜机会饕餮一餐，自然选择将这种偏好保留了下来。 但是到了食物富足的今日，这种在远古时期让我们的祖先生存下来的偏好就成了一种负担，人们不得不疲于各种健身减肥和抵御美食的诱惑。 有一部分人患上了「肥胖症」。 这似乎指向了一种天生的基因缺陷，是基因的错，这类人受基因奴役，导致他们吃个不停最终患上肥胖症。 1. 宿命论当然谁对谁错界定责任是伦理话题，今天我们只是想谈谈宿命论和决定论。 随着科学技术的发展，人们越来越了解这个世界运行的物理法则。 于是有一部分人会跳出来反对科学，认为科学太过霸道： 既然一切事情都是遵循物理法则的，那么我现在所做的一切事情都是被决定的，那我就没有自由意志了，岂不是什么都不用做了，因为一切都被宿命安排好了。 我们称以上这种观点为宿命论。 这确实是一个很难回答的问题。 从物理学的角度来说，如果我们知道宇宙大爆炸那一刻的所有物理粒子的状态，那么根据物理定律我们就能推演出今天所有事物的状态，以及未来世界的状态。 但问题是，我们永远无法知道这个世界的所有信息。 量子力学就给出了一个例子。如果我们去测量一个量子实体的动量，我们就无法知道它的位置；如果我们去测量它的位置，那就测不到它的动量。 所以虽然理论上，如果知道了宇宙所有物理粒子的状态，我们就可以推演出未来的世界的状态。就像如果我们能够找到一个光滑无摩擦力的接触面，我们就能造出永动机。 但显然我们做不到。 2. 决定论既然世界在任一时刻的状态，皆由此前一时刻的状态完全决定（我们称此为决定论）；那么，我们的自由意志应该何处安放。 这里我们要强调，决定论和自由意志虽然看上去有点互相违背，但实际上是兼容的。 例如你和一台超级电脑在下象棋。这台超级电脑掌握了象棋的所有棋谱，几乎百分之百能够赢你。而你则不可能像电脑一样掌握所有棋谱。但是你仍然全力以赴，仔细思考每一步棋要怎么走。 现在我们站在电脑的角度来思考，因为它掌握了所有棋谱（所有信息），所以它能够预测所有的未来是怎么样的，在所有可能的状态中击败你。 换而言之，你的未来已经是被决定了的，就是被这台超级电脑打败。 但这是不是就意味着，你在下棋的时候没有了自由？ 显然不是的，虽然你知道自己终有一败，但你的行为仍然是有自由度的，可以下出最自己最好的状态，虽然这一状态早已在超级电脑的数据库里被写好。 站在你的视角来看，你的自由意志仍然存在，并且工作得很好。 哪怕从整个系统上看，一切都是决定好的。 3. 因果定律人的永恒宿命就是终有一死，这是被生物的基因所决定的。 同时基因或者世界的其他物理法则等等都给我们定下了许多规则，我们遵守因果定律，但并不是代表我们就没有了自由度，没有了选择。 服从因果定律并不是自由意志的对立面。 如果因果定律是自由意志的对立面的话，那么疯子才最自由，因为对他们的行为很难做出因果推断。","categories":[{"name":"生活","slug":"生活","permalink":"https://singa.site/categories/%E7%94%9F%E6%B4%BB/"},{"name":"转载","slug":"转载","permalink":"https://singa.site/categories/%E8%BD%AC%E8%BD%BD/"}],"tags":[{"name":"转载","slug":"转载","permalink":"https://singa.site/tags/%E8%BD%AC%E8%BD%BD/"},{"name":"生活","slug":"生活","permalink":"https://singa.site/tags/%E7%94%9F%E6%B4%BB/"}],"keywords":[{"name":"生活","slug":"生活","permalink":"https://singa.site/categories/%E7%94%9F%E6%B4%BB/"},{"name":"转载","slug":"转载","permalink":"https://singa.site/categories/%E8%BD%AC%E8%BD%BD/"}]},{"title":"使用简单的逻辑方法进行独立思考","slug":"使用简单的逻辑方法进行独立思考","date":"2020-01-04T12:28:59.000Z","updated":"2020-01-09T00:43:24.000Z","comments":true,"path":"2020/01/04/使用简单的逻辑方法进行独立思考/","link":"","permalink":"https://singa.site/2020/01/04/%E4%BD%BF%E7%94%A8%E7%AE%80%E5%8D%95%E7%9A%84%E9%80%BB%E8%BE%91%E6%96%B9%E6%B3%95%E8%BF%9B%E8%A1%8C%E7%8B%AC%E7%AB%8B%E6%80%9D%E8%80%83/","excerpt":"","text":"1.信息数据可考证如果一个观点或是一个见解的数据是错误的，那么就会造成后面的观点全是错的，所以，首要的是要进行数据的查证或考证。一般来说，如果一篇文章的作者足够严谨的话，他的需要给他的数据建立相关的引用或是可以考证的方法方式。如果一篇文章中出现的是，“有关专家表明”、“美国科学家证明”、“经济学家指出”，但是没有任出处，也没有点明这个专家或是科学家的名字，或是，也没有说明或引用让读者可以自己去验证的方法。那么，其引用的话或是数据是无法考证的，如果是无法考证的，那么，这篇文章的水份就非常大了。 2.处理集合和其包含关系这是一个非常简单的人人都会的数学逻辑。比如：哲学家是人，柏拉图是哲学家，所以，柏拉图是人。就是一个在包含关系下的推理。你不要小看这个简单的逻辑，其实很多人并不会很好的应用，相反，当感情支配了他们以后，他们会以点代面，以特例代替普遍性。比如，地图炮就是一种，他们看到了多个案例，他们就开始把这个案例上升上更大的范围，比如：河南人新疆人都是小偷，上海人都是小市民。日本人都是变态和反人类……等等。除了这些地图炮外，还有否定整个人的，比如一个人犯了个错或是性格上有缺陷，就会把整个人全盘否定掉，员工抢个月饼就上升到其价值观有问题等等。在数学的逻辑包含中，超集的定义可以适用于子集，通过子集的特征可以对超集进行探索，但是没法定义超集。另外，集合的大小也是一个很重要的事，幸存者偏差会是一个很容易让人掉下去的陷阱，因为可能会有很大的样本集可能在你的视线盲区。 3.处理逻辑因果关系所谓因果关系，其实就是分辨充分条件、必要条件和充分必要条件，然后处理其中的逻辑是否有关联性，而且有非常强的因果关系。没有能力分辨充分必要条件处理因果关系是很多人的硬伤。比如：掩耳盗铃、刻舟求剑就是因果关系混乱的表现。人们会经常地混淆两个看来一起发生，但是并没有关联在一起的事。因果关系是最容易被模糊和偷换的，比如：很多人都容易混淆“加班”就会有“产出”，混淆了“行动”就会有“结果”，混淆了“抵制”就会赢得“尊重”，混淆了“批评”等于“反对”等等。除了这些以外，微信公众号里的很多时评文章，他们的文章中的结论和其论据是没有因果关系的，好多文章就是混淆、模糊、偷换……因果关系出问题的文章读多了是对大脑有损伤的，要尽量远离。 4.找到靠谱的基准线就像我们写代码一样，我们都是会去找一些最佳实践或是业内标准，原因是因为，这样的东西都是经过长时间被这个世界上很多人Review过的，是值得依赖和靠谱的，他们会考虑到很多你没有考虑过的问题。所以，你也会看到很多时评都会找欧美发达国家的作参考的做法，因为毕竟人家的文化是相对比较文明、科学、开放和先进的。找到世界或是国际的通行标准，会更容易让人进步。比如：以开放包容加强沟通的心态，就会比封闭抵制敌对的心态要好得多得多，智者建桥，愚者建墙。当然，我们也开始发现，有一些事上，有利于自己的就对标，不利于自己的就不对标，而且，除了好的事，不好的事也在找欧美作对标，于是开始“多基准线”和“乱基准线”，这种方式需要我们小心分辨。 5.更为深入和高维的思考如果一件事情只在表面上进行思考其实只是一种浅度思考，在Amazon，线上系统出现故障的时候，需要写一个Correction of Errors的报告，其中需要Ask 5 Whys（参看 Wikipedia 的 Five Whys 词条），这种思考方式可以让你不断追问到深层次的本质问题，会让你自己做大量的调查和研究，让你不会成为一个只会在表面上进行思考的简单动物。比如：当你看到有出乎你意料的事件发生时（比如负面的暴力事件），你需要问一下，为什么会发生，原因是什么？然后罗列尽可能全的原因，再不断地追问并拷证下去（这跟写程序一样，需要从正向案例和负向案例进行考虑分析，才可能写出健壮性很强的代码），我们才会得出一个比较健壮的答案或结构。 总结需要注意的是，在上述的这五种思维方式下，你的思考是不可能快得起来的，这是一个“慢思考”（注：如果读过《思考，快与慢》这本书的人就知道我在说什么），独立思考是需要使用大脑中的“慢系统”，慢系统是反人性的，所以，能真正做到独立思考的人很少。更多的人的“独立思考”其实只不过是毫无章法的乱思考罢了。 通过上述的这五点，我相信你是很容易识别或是分辨出哪些信息是靠谱的，哪些信息是很扯的，甚至会改善你自己的言论和思考。但是，请注意，这些方法并不能让你获得真理或是真相。但是这也够了，一个人如果拥有了能够分辨是非的能力，也是很不错的了。虽然不知道事实是什么，但是你也不会盲从和偏信，从而不会被人煽动，而成为幕后黑手的的一只“肉鸡”。","categories":[{"name":"生活","slug":"生活","permalink":"https://singa.site/categories/%E7%94%9F%E6%B4%BB/"},{"name":"转载","slug":"转载","permalink":"https://singa.site/categories/%E8%BD%AC%E8%BD%BD/"}],"tags":[{"name":"转载","slug":"转载","permalink":"https://singa.site/tags/%E8%BD%AC%E8%BD%BD/"},{"name":"生活","slug":"生活","permalink":"https://singa.site/tags/%E7%94%9F%E6%B4%BB/"}],"keywords":[{"name":"生活","slug":"生活","permalink":"https://singa.site/categories/%E7%94%9F%E6%B4%BB/"},{"name":"转载","slug":"转载","permalink":"https://singa.site/categories/%E8%BD%AC%E8%BD%BD/"}]},{"title":"改变从克服思维惰性开始","slug":"改变从克服思维惰性开始","date":"2020-01-03T13:41:29.000Z","updated":"2020-01-09T00:43:24.000Z","comments":true,"path":"2020/01/03/改变从克服思维惰性开始/","link":"","permalink":"https://singa.site/2020/01/03/%E6%94%B9%E5%8F%98%E4%BB%8E%E5%85%8B%E6%9C%8D%E6%80%9D%E7%BB%B4%E6%83%B0%E6%80%A7%E5%BC%80%E5%A7%8B/","excerpt":"","text":"很多时候，人缺乏的不是“小目标”、不是成功的能力，而是缺乏实实在在的努力——克服自己的惰性。克服惰性确实是一个让人觉得痛苦的过程，但是养成习惯，便也能慢慢成了自然。走出舒适区，无论是思维上的还是行动上的，你会发现一个新世界，一个新自己。 每当谈到我们的大脑，很多人似乎都是让它处在自由驾驶的模式：不是有意识地去培养自己的创造力、专注力和同理心，而是任由自己成为一个懒得思考的人，被自我、偏见和情绪所左右。 爱德华·赫斯（Edward Hess）教授在他的著作《学习的科学：如何学习得更好更快》一书中说：这种惰性在我们的基因当中。并且，为了储存能量，大脑倾向于低速运转。 不过幸好，在书中赫斯教授还提到了一些方法，有助于你摆脱这种思维的惰性，更积极地思考，增强自己的精神力量。 1. 质疑自己的假设思维懒惰的人会本能地去寻找那些支持他们观点的信息，而过滤掉和他们已知相冲突的讯息。这会省去很多思考和分析所要花费的精力。 而当你质疑自己一贯认为的假设，正意味着你开始锻炼起自己思维的肌肉了，去发现和纠正思维中的误区。同时，这也会让你对新的观点持有更开放的立场。 2. 不要轻易下判断另一种惰性思维方式就是对人对事做出迅速的判断和结论，这在我们的工作和生活中常常会发生：“那主意糟透了”、“他是个白痴”、“她没有付出足够的努力”……这种应激式的判断会让人与人之间生出隔阂和憎恨。而相反，如果你给别人或者事情多点时间，等到另一只靴子落地，会发现初次的印象可能会有改观，而这将创造合作和对话的可能。 3. 打破一成不变的“规则”这个日新月异的时代已经充分教给我们：唯一不变的就是变化。墨守成规是惰性思维的另一个典型表现。如果根据既定的配方就能得到自己想要的、就能成功，那还要智慧和创新干什么？ 懒惰曾促进过革命性的发明，但是如今这个社会，商业高速运转、科技极速迭代，需要持续的冒险和创新精神。摆脱成规让你从多条路径通向成功。 4. 做决定前保持冷静你遇到充满威胁感的人和事的时候你会怎么办？是不是最先想到的就是主动出击或是逃跑。在商业社会，这样的下意识冲动决定往往会带来不佳的结果：攻击性的反应会让人疏远，保守的方式则可能会失掉机遇。 当你等待片刻直到自己足够冷静再做决定，不只是反应，更是分析、计划和执行，那么，经过深思熟虑的决定会更可能带来好的结果。 5. 换个角度看待问题只从自己的角度看问题无疑也是惰性思维的表现，而且往往被认为是情商低。从这些人或事会怎么影响自己以及为我所用的角度思考问题是人的本能，而去考虑这件事将会怎么影响别人、大家能怎么合力完成一件事，这需要更大的能量和智慧。 6. 更多倾听一般而言，人讲话的语速为每分钟160至180个汉字左右，而听别人讲话时可以每分钟输入600个字，这意味着，人们的大脑可以更多地处理输入的内容，本身就可以做一个好的倾听者。 在倾听这个问题上，思维也是很容易偷懒的：你允许自己的思绪云游。比如想想下一步说什么、接下来做什么甚至是晚上吃点什么等。 如果给倾听加上形容词，不是被动，而应是积极的，跟随别人的逻辑、内容，同时在自己的大脑中加以归纳、分析。好处显而易见，因为你听得越多，你就能记住更多、学到更多。另一方面，你的客户、同事会发现你是一个看重他们所讲内容的人，这会让你的人际关系更为润滑。 无论是固守成见还是立刻下结论、是缩在自己的视角还是怠于倾听，这些其实都反映了我们隐蔽的思维惰性。思维影响行为，行为铸造习惯，习惯奠定人生。想改变，不妨从改变思维的惰性开始。","categories":[{"name":"生活","slug":"生活","permalink":"https://singa.site/categories/%E7%94%9F%E6%B4%BB/"},{"name":"转载","slug":"转载","permalink":"https://singa.site/categories/%E8%BD%AC%E8%BD%BD/"}],"tags":[{"name":"转载","slug":"转载","permalink":"https://singa.site/tags/%E8%BD%AC%E8%BD%BD/"},{"name":"生活","slug":"生活","permalink":"https://singa.site/tags/%E7%94%9F%E6%B4%BB/"}],"keywords":[{"name":"生活","slug":"生活","permalink":"https://singa.site/categories/%E7%94%9F%E6%B4%BB/"},{"name":"转载","slug":"转载","permalink":"https://singa.site/categories/%E8%BD%AC%E8%BD%BD/"}]},{"title":"C#编码规范","slug":"CSharp编码规范","date":"2019-12-31T13:55:09.000Z","updated":"2020-01-09T00:43:24.000Z","comments":true,"path":"2019/12/31/CSharp编码规范/","link":"","permalink":"https://singa.site/2019/12/31/CSharp%E7%BC%96%E7%A0%81%E8%A7%84%E8%8C%83/","excerpt":"","text":"C#命名规范中文版/C#编码规范中文版示例123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081using System;/// &lt;summary&gt;/// 命名空间(Pascal)/// &lt;/summary&gt;namespace Namespace&#123; /// &lt;summary&gt; /// 类(Pascal) /// &lt;/summary&gt; public class Class &#123; /// &lt;summary&gt; /// 属性(Pascal) /// &lt;/summary&gt; public int Property &#123; get; set; &#125; /// &lt;summary&gt; /// 委托(Pascal) /// EventHandler后缀 /// &lt;/summary&gt; public delegate void EvnetHandler(); /// &lt;summary&gt; /// 事件(Pascal):On前缀 /// &lt;/summary&gt; public event EvnetHandler OnEvent; /// &lt;summary&gt; /// 公有字段(Pascal) /// &lt;/summary&gt; public readonly int Field1; /// &lt;summary&gt; /// 受保护字段(Pascal) /// &lt;/summary&gt; protected int Field2; /// &lt;summary&gt; /// 私有字段(_Camel) /// &lt;/summary&gt; private int _field3; /// &lt;summary&gt; /// 方法(Pascal) /// &lt;/summary&gt; /// &lt;param name=\"args\"&gt;参数(Camel)&lt;/param&gt; public void Method(int args) &#123; //局部变量(Camel) int variable = 10; &#125; &#125; /// &lt;summary&gt; /// 接口(Pascal) /// &lt;/summary&gt; public interface IInterface &#123; /// &lt;summary&gt; /// 属性接口(Pascal) /// &lt;/summary&gt; int Property &#123; get; set; &#125; /// &lt;summary&gt; /// 方法接口(Pascal) /// &lt;/summary&gt; /// &lt;param name=\"args\"&gt;&lt;/param&gt; void Method(int args); &#125; /// &lt;summary&gt; /// 枚举(Pascal) /// &lt;/summary&gt; enum Enum &#123; Enum1,//枚举值(Pascal) Enum2,//枚举值(Pascal) &#125;&#125; 参考资料 微软官方老版本:https://msdn.microsoft.com/en-us/library/ms229043(v=vs.100).aspx 微软官方新版本:https://docs.microsoft.com/en-us/dotnet/standard/design-guidelines/capitalization-conventions ReSharper:https://www.jetbrains.com/help/resharper/Coding_Assistance__Naming_Style.html dofactory:http://www.dofactory.com/reference/csharp-coding-standards https://github.com/ktaranov/naming-convention/blob/master/C%23%20Coding%20Standards%20and%20Naming%20Conventions.md https://gist.github.com/jburditt/3178227739d3a604663e58fc2e6c15c5 https://www.jianshu.com/p/0d09cc624dae https://github.com/wanfangdata/guide/blob/master/dotnet%E5%BC%80%E5%8F%91%E8%A7%84%E8%8C%83/%E7%BC%96%E7%A0%81%E8%A7%84%E8%8C%83.md https://gist.github.com/zhuqling/a2700703d088b8746f0c 通用规则所有的命名都是以下面两种方式进行命名: PascalCasing(匈牙利命名法:每个词的第一个字母大写) camelCasing(骆驼命名法:第一个词的第一个字母小写,之后每个词的第一个字母大写) 类型 命名方式 示例 Namespace Pascal namespace System.Security { ... } Type Pascal public class StreamReader { ... } Interface Pascal public interface IEnumerable { ... } Method Pascal public virtual string ToString(); Property Pascal public int Length { get; } Delegate Pascal public delegate void EvnetHandler(); Event Pascal public event EventHandler Exited; Public Field Pascal public readonly int Min = 0; Protected Field Pascal protected int Min = 0; private Field Camel private int _min = 0; Enum Pascal public enum FileMode Parameter Camel public static int ToInt32(string value) Local Variable Camel void Method(){int number = 10;} 特殊说明注释文件注释: 文件注释以如下方式进行,在扩展注释时(回车换行时)会自动添加注释行. 12345678/******************************************************************** Description:This is a example class* Version: 1.0.0* Date: 20191231* Author: SingaShen* Email: isinga.im@gmail.com* Copyright @ singa.site*******************************************************************/命名空间 类型 接口 方法名 属性 事件 字段 枚举:以”///“的方式注释,编辑器会自动完善注释,并且可以用生成工具直接生成代码注释文档. 123456789/// &lt;summary&gt;/// 方法(Pascal)/// &lt;/summary&gt;/// &lt;param name=\"args\"&gt;参数(Camel)&lt;/param&gt;public void Method(int args)&#123; //局部变量(Camel) int variable = 10;&#125;其他注释:以”//“的方式注释在上一行或行尾添加注释(比如局部变量,逻辑行)段落注释:以如下方式进行 123456/* public void Method() &#123; &#125;*/ 待办及高亮:在注释中添加”ToDo”高亮显示注释 命名空间类型 结构体命名方式与类一致 泛型默认T 多个泛型根据反编译微软dll,建议命名T1,T2,T3,T4… 接口接口定义以”I”开头,比如IInterface,IPlayer 方法属性属性都以Pascal方式命名 委托微软官方建议添加以下两种后缀 EventHandler Callback微软官方不建议添加以下后缀 Delegate 事件 微软官方建议:事件参数添加后缀”EventArgs” 习惯命名:事件以On为前缀(比如OnClick) 字段微软团队初期使用Camel方式命名私有字段,后来逐步采用下划线+Camel方式命名,这样做的好处是不必再识别字段是否是局部变量. 字段建议是非Public类型的,以属性替换公有的字段:这样外部访问更安全(readonly,const等除外),并且外部调用者全部使用Pascal命名方式调用对象逻辑. 微软官方只规定了public/protected以Pascal方式命名,对internal,private类型的字段没有说明,因此各种第三方规范和插件中对私有字段规范也不一致. 针对官方的示例代码,书写习惯,智能提示,代码补全和约定俗成的C#规范,建议private采用下划线+Camel方式命名,非Private字段采用Pascal方式命名. 参考微软官方命名规则,C#高级编程,Resharp命名规范,.Net源码命名规则,建议字段命名方式如下: public/protected/internal以Pascal方式命名 private以下划线+Camel方式命名12345678910public readonly int Field1;public const int Field2 = 0;internal readonly int Field3;internal const int Field4 = 0;private int _field5;private static int _field6;private readonly int _field7;private const int _field8 = 0; 以m_为前缀的方式不建议(C++命名方式) 以类型为前缀的方式不建议(比如bool类型的字段以b为前缀,枚举以e为前缀) 以类型为后缀的方式不建议(比如单位列表unitList,直接取名为units) 枚举参数局部变量局部变量可以使用var自动声明类型","categories":[{"name":"开发","slug":"开发","permalink":"https://singa.site/categories/%E5%BC%80%E5%8F%91/"},{"name":"转载","slug":"转载","permalink":"https://singa.site/categories/%E8%BD%AC%E8%BD%BD/"}],"tags":[{"name":"开发","slug":"开发","permalink":"https://singa.site/tags/%E5%BC%80%E5%8F%91/"},{"name":"转载","slug":"转载","permalink":"https://singa.site/tags/%E8%BD%AC%E8%BD%BD/"}],"keywords":[{"name":"开发","slug":"开发","permalink":"https://singa.site/categories/%E5%BC%80%E5%8F%91/"},{"name":"转载","slug":"转载","permalink":"https://singa.site/categories/%E8%BD%AC%E8%BD%BD/"}]},{"title":"git五分钟教程","slug":"git五分钟教程","date":"2019-12-30T14:41:42.000Z","updated":"2020-01-09T00:43:24.000Z","comments":true,"path":"2019/12/30/git五分钟教程/","link":"","permalink":"https://singa.site/2019/12/30/git%E4%BA%94%E5%88%86%E9%92%9F%E6%95%99%E7%A8%8B/","excerpt":"","text":"git五分钟教程使用您当前目录作为Git仓库，我们只需使它初始化。 1git init 使用我们指定目录作为Git仓库。 1git init newrepo 添加新文件 1git add filename 提交版本 1git commit -m &quot;Adding files&quot; 当我们修改了很多文件，而不想每一个都add，想commit自动来提交本地修改，我们可以使用-a标识。 1git commit -a -m &quot;Changed some files&quot; 从服务器克隆一个库并上传。 1git clone ssh:&#x2F;&#x2F;example.com&#x2F;~&#x2F;www&#x2F;project.git 现在我们修改之后可以进行推送到服务器 1git push ssh:&#x2F;&#x2F;example.com&#x2F;~&#x2F;www&#x2F;project.git 如果您已经按上面的进行push，下面命令表示，当前分支自动与唯一一个追踪分支进行合并。 1git pull 从非默认位置更新到指定的url。 1git pull http:&#x2F;&#x2F;git.example.com&#x2F;project.git 如何你想从资源库中删除文件，我们使用rm。 1git rm file 分支在本地完成，速度快。要创建一个新的分支，我们使用branch命令。 1git branch test branch命令不会将我们带入分支，只是创建一个新分支。所以我们使用checkout命令来更改分支。 1git checkout test 第一个分支，或主分支，被称为”master”。 1git checkout master 对其他分支的更改不会反映在主分支上。如果想将更改提交到主分支，则需切换回master分支，然后使用合并。 12git checkout mastergit merge test 如果您想删除分支，我们使用-d标识。 1git branch -d test 如果你想掌握git命令行。 1多多使用","categories":[{"name":"开发","slug":"开发","permalink":"https://singa.site/categories/%E5%BC%80%E5%8F%91/"}],"tags":[{"name":"开发","slug":"开发","permalink":"https://singa.site/tags/%E5%BC%80%E5%8F%91/"}],"keywords":[{"name":"开发","slug":"开发","permalink":"https://singa.site/categories/%E5%BC%80%E5%8F%91/"}]},{"title":"一些重要问题","slug":"一些重要问题","date":"2019-12-26T14:15:28.000Z","updated":"2020-01-09T00:43:24.000Z","comments":true,"path":"2019/12/26/一些重要问题/","link":"","permalink":"https://singa.site/2019/12/26/%E4%B8%80%E4%BA%9B%E9%87%8D%E8%A6%81%E9%97%AE%E9%A2%98/","excerpt":"","text":"Q: 什么是存在 What is Being (Dasein)?A: 存在的最根本属性是稳定性。 Q: 什么是生命？ What is life?A: 生命区分于其他事物不能简单等同于有机物区分与无机物，碳基甚至硅基也不一定。但是生命会普遍导致熵减少。 Q: 生命的意义是什么？ What is the meaning of life?A: 从生物学的角度来说，生命的唯一目是自我复制。繁衍是生命的本能。当然人类这种高等生物，还会追求影响他人，著书立言这种精神复制 Q: 物理学里为啥那么多对称性？ Why symmetry?A: 识别相似 是认知世界最基础的方法和手段。如果没法识别 对称 和 相似，那么模式只能被穷举。对称是对半折叠认知空间最有效的办法。 Q: 计算机科学里为啥学那么多种排序算法？排序有啥好玩的？ Why learning sorting in CS?A: 人工控制的熵减少是智慧的表现 Q: 为什么算法里那么讲究迭代和递归？Why iteration and recursion?A: 用对称的手段去认识世界。 Q: 递归、对称这些有什么共同点A: 宇宙的自我相似性。所谓 全息性 或者 分形。 Q: 为什么遗忘那么痛苦？ Why forgetting is painful?A: 因为麦克斯韦之妖需要在 遗忘 的时候做功。写入放大。 Q: 唯物主义有什么问题？ Why not Materialism?A: 有一些东西，他们是非物质在的存在(nothingness)。比如 洞，影子，缝隙。可以把这些东西理解为 负存在。比如洞填满了就没有洞了，影子去掉遮挡就没影子了，缝隙合上就没有缝隙了。但是这种 「负存在」 具备几乎一切实体物质的属性，比如大小 尺寸 颜色 方向 颜色 等等，而且非常重要。原始人找不到 洞 作为栖息地可能也就没有人类了。 Q: 什么是意识？What is consciousness?A: 如果把人类这种生物看成一类肉体(class)，那么意识就是每个个体(instance)的 this 指针。学过 OOP 面向对象编程的容易理解这个。意识是否存物理在呢？当然。this 指针需要占据内存空间。意识可否迁移呢？意识或许可以被持久化(serialization)，但是做 migration 并不容易。意识也无法合并。只能相互传值(pass by value) Q: 为什么不讲哲学三大问？A: 哲学三大问题是：终极存在是什么，终极解释是什么，终极价值是什么；简而言之就是 真 美 善 是什么，对应哲学的方向：本体论、认识论、价值论。","categories":[{"name":"生活","slug":"生活","permalink":"https://singa.site/categories/%E7%94%9F%E6%B4%BB/"},{"name":"思考","slug":"思考","permalink":"https://singa.site/categories/%E6%80%9D%E8%80%83/"},{"name":"转载","slug":"转载","permalink":"https://singa.site/categories/%E8%BD%AC%E8%BD%BD/"}],"tags":[{"name":"转载","slug":"转载","permalink":"https://singa.site/tags/%E8%BD%AC%E8%BD%BD/"},{"name":"生活","slug":"生活","permalink":"https://singa.site/tags/%E7%94%9F%E6%B4%BB/"},{"name":"思考","slug":"思考","permalink":"https://singa.site/tags/%E6%80%9D%E8%80%83/"}],"keywords":[{"name":"生活","slug":"生活","permalink":"https://singa.site/categories/%E7%94%9F%E6%B4%BB/"},{"name":"思考","slug":"思考","permalink":"https://singa.site/categories/%E6%80%9D%E8%80%83/"},{"name":"转载","slug":"转载","permalink":"https://singa.site/categories/%E8%BD%AC%E8%BD%BD/"}]},{"title":"hexo常用操作","slug":"hexo常用操作","date":"2019-12-26T13:14:20.000Z","updated":"2020-01-09T00:43:24.000Z","comments":true,"path":"2019/12/26/hexo常用操作/","link":"","permalink":"https://singa.site/2019/12/26/hexo%E5%B8%B8%E7%94%A8%E6%93%8D%E4%BD%9C/","excerpt":"","text":"Hexo 常用操作 hexo help # 查看帮助 hexo version #查看Hexo的版本 hexo new “postName” #新建文章 hexo new post “title” # 生成新文章：\\source_posts\\title.md，可省略post hexo new page “pageName” #新建页面 hexo clean #清除部署缓存 hexo n == hexo new #新建文章 hexo g == hexo generate #生成静态页面至public目录 hexo s == hexo server #开启预览访问端口（默认端口4000，’ctrl + c’关闭server） hexo d == hexo deploy #将.deploy目录部署到GitHub hexo d -g #生成加部署 hexo s -g #生成加预览","categories":[{"name":"开发","slug":"开发","permalink":"https://singa.site/categories/%E5%BC%80%E5%8F%91/"}],"tags":[{"name":"开发","slug":"开发","permalink":"https://singa.site/tags/%E5%BC%80%E5%8F%91/"}],"keywords":[{"name":"开发","slug":"开发","permalink":"https://singa.site/categories/%E5%BC%80%E5%8F%91/"}]},{"title":"计算机程序员的职业荣誉","slug":"计算机程序员的职业荣誉","date":"2019-12-24T12:23:08.000Z","updated":"2020-01-09T00:43:24.000Z","comments":true,"path":"2019/12/24/计算机程序员的职业荣誉/","link":"","permalink":"https://singa.site/2019/12/24/%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%A8%8B%E5%BA%8F%E5%91%98%E7%9A%84%E8%81%8C%E4%B8%9A%E8%8D%A3%E8%AA%89/","excerpt":"","text":"为了捍卫和维护计算机程序员的职业荣誉，我承诺，尽我所能和判断力： 1、我不会产生有害的代码。 2、我制作的代码永远是我最好的作品。我不会故意允许在行为或结构上有缺陷的代码。 3、每次发布时，我都会生成一个快速、可靠、可重复的证据，证明代码的每个元素都应该正常工作。 4、我将经常发布小版本，这样我就不会妨碍其他人的进展。 5、我会抓住每一个机会，无畏地，不懈地改进我的代码。我永远不会损害它们。 6、我将尽我所能保持自己和他人的生产力。我不会做任何降低生产力的事情。 7、我将继续确保支持其他人的工作，并且他们也可以支持我的工作。 8、我将对幅度和精度做出诚实的估计。我不会作出做不到的诺言。 9、我将永远不会停止学习和改进我的手艺。","categories":[{"name":"开发","slug":"开发","permalink":"https://singa.site/categories/%E5%BC%80%E5%8F%91/"}],"tags":[{"name":"开发","slug":"开发","permalink":"https://singa.site/tags/%E5%BC%80%E5%8F%91/"}],"keywords":[{"name":"开发","slug":"开发","permalink":"https://singa.site/categories/%E5%BC%80%E5%8F%91/"}]}]}